终究要说再见了，16年春秋，也是我人生中最宝贵的青春都留在了这里。曾经看到自己刚来华为时写的总结、整理的资料，心里也是百感交集，现在真正要走了心情却出奇的平静。
在华为的工作时光，有时会觉得自己就是一只拉磨的驴，蒙着眼，前面吊着胡萝卜，后面抽着鞭子，一圈一圈的拉磨。现在终于可以撂下挑子，去做一只山林中自由奔跑的驴了：）。
无论如何，我仍然感谢公司，华为公司是伟大的公司，是中华民族真正崛起占领高端产业链的希望。能被这个世界唯一的超级大国作为对手是我们的荣耀。我相信许多年后，美国制裁华为一定会写进中国的现代史，史书上会有任老板，孟总的名字，而我们只是无名之辈。但是想到自己是这个事件的亲历者和见证者，我仍然感到非常自豪。我把人生中最宝贵的年华留在了这里，我的人生参与了一件有意义的事，也获得了回报，我没有任何遗憾了。相信公司一定能走出困境，衷心祝他越来越好。
也感谢所有相处过、帮助支持过我的同事，衷心的祝愿大家都能升值加薪，早日实现财富自由。

个人认为我的职业生涯算不上多成功，就不写什么职场生存心得了，最后只写点自己的人生体会和经验吧，大家读了觉得不对的就当胡说八道，如果有共鸣也算是一点干货吧。

一、第一个人生经验送给那些天性纯良的孩子，因为我就是这样的人。什么叫天性纯良，就是从小听话、守规矩、诚实、坚信正义和公平的人，但是真正到了社会上才发现课本从来不会教我们认识真正的社会。
现代社会我们倡导公平、正义，古代中国统治阶级推崇儒家的仁义礼智信，可历史上的帝王争夺权力弑父弑兄的事情一个没少干。天地不仁以万物为刍狗，主导自然运转的是自然规律，而主导社会运转的是人性。人性既不是黑的，也不是白的，作为集体的一员我们倡导公平，
作为个人又希望规则向自己倾斜，人性是灰色的，是复杂矛盾的。
1。所以不要做理想主义者，在这个社会上所倡导的那些，有些话是用来洗脑的，有些话是用来遮羞的，有些话是PUA 自己的朴素愿望，千万别把这些当真，不然你就是扑火的飞蛾。比如曾经的胡玲，如果她说的都是真话那我很钦佩她，但是她注定是被牺牲的。
2。要仔细观察你所处的社会、团队、集体真正是怎么进行奖惩的，这才是团体里真正运转的规则。抱怨规则的不公没有任何意义，要么顺应规则狠，要么寻找适合自己的团体滚，要么忍起来，为将来的狠和滚蓄力。
3。善良是珍贵的品质，所以一定要做好筛选，把你的善良留给配得上他的人。
4。世界是灰色的，有些人老实的遵守规则，有些人暴力的破坏规则，这两类人都不是得利的，而有一类人要么是设计规则的人，让规则有利于自己，要么利用手中的资源合理的利用规则、规避规则，要么施以小利在社会能接受的尺度上有限度的破坏规则。这些人才是真正最吃香的人，看看美国和俄罗斯的外交就是真实写照，这就是现实。

二、过了40岁，才真正理解万事万物都逃不过周期，一年有春去秋来，人不会永远年轻有干劲，我们会衰老，职场也必然有高峰低谷。
1。要趁着自己能赚钱的时候多赚钱，因为以后不一定还能赚这么多。处于高峰时，要善待他人，不要因为明明与你没有利益冲突，只因为傲慢和偏见就给自己树敌，处于低谷时，要善待自己，无论外界如何质疑、诋毁你，都要相信自己的能力，把精力放在如何把事情做好上，不要在别人的攻击上内耗，这样你就一定能重新爬出泥沼。
2。经济一样有规律周期，有经济复苏、增长就有减退、衰落，不同的经济周期有不同的投资策略，不要拿过去的经验硬套，因为不同的经济周期结论可能是完全相反的，当然大环境不好的时候也一样有机会，但是凭什么确定你看到就是机会?看看自己有没有那本事那资源再说。普通人在经济下行周期不要乱投资，冬天的时候保住财富就是赢家，等待春暖花开。
3。过了四十岁会相信命运，从你出生起，你父母的认知、财富以及遗传给你的基因就决定了你人生的下限和上限，你所处的时代是经济上升周期还是衰退周期也决定了你是顺势还是逆势，只能说你获得的已经是能获得的最好的，活在当下，努力打好手中的牌。原生家庭不能选择，但是伴侣、职业、工作都是我们可以选择的，要想打好牌你得清楚自己有什么牌，越早了解自己的优势，清楚白己想要的是什么，就能越早做出正确的选择。

最后写点自己对人生的理解。
三、人生的意义。
在这个世界的准则中，运动就要做功，没有什么是可以凭空获得的，都要付出相应的代价，就好像无论你做过什么也不过是物质的转换，而你终将消亡。在宇宙的空间和时间尺度上，人也是如此渺小，以至于我们就像人类眼中的细菌无足轻重，人生似乎注定是虚无的。
那我们努力生活的意义又在哪里呢?在我看来，我们做每一件事情讲究的是结果，过程并不重要，可人生却恰恰相反，从我们来到这个世界的第一刻，我们就在等待死亡，人生的结果是注定的，但过程却不是注定的，所以人生重要的意义不在于最终的结果，而是生命的过程。
我们不停的进行做功来完成物质交换，就好比将一个橘子换成一个苹果，但是我不需要或者不喜欢橘子，我喜欢苹果，苹果能为我带来快乐。在客观的物质交换的过程中，我们收获了主观的精神价值。
因此人生的意义就在于人生的体验，我们去追寻自己，寻找自己真正想要的精神价值，并为此努力，过完一生。好比玩游戏，游戏终将通关或结束，但我们会因为这个就不去玩游戏吗，当然不会，游戏真正的价值在于玩的过程中体会到的快乐不是吗。

四、那么如何快乐的度过自己的一生呢。
有时候我真的觉得国人活得太累了，我们从生下来开始就像背着KPI，要比赛要竞争，似乎只有不停的忙碌才能获得基本体面的生活，一旦想休息，医疗教育养老哪个都不敢掉以轻心。一代代在怪圈中循环。哪里还有什么人生体验可言。
为什么会这样？我认为有两个原因
1．精神PUA，东亚是被儒家思想高度浸润的社会，儒家积极入世的理论让大家勤劳奋斗，标榜仁义礼智信的等级纲常让大家按照规则乖乖听话。这套东西历经千年已经深入中国人的血液，一直到现代的中国社会，其实本质上还是一个威权主义等级社会。为什么中国人那么喜欢站队和爱面子呢，本质上都源于依赖威权强调服从的社会结构，因为站队错误意味着立场错误，你的资源就会被限制和剥夺以示惩罚；丢了面子意味着威权受到挑战，威权的威慑力会削减。在这种社会架构里价值观一定是单一的，我们从小被教育要追逐成功，要成为对社会有用的人，似乎你不成功你对社会没有价值你就不配为人。就连成功的标准也是恒定唯一的，要么有钱要么有权要么有名，你才会被认为是成功人士。
这正常吗，为什么一定要去追求被定义的成功呢，做个平凡的人又有什么错呢？事实就是无论怎么内卷大多数人注定就是平凡的。这个世界上没有两片相同的树叶，也没有两个相同的人，每个人最想要获得的人生体验一定不是相同的。人生是一片旷野，不是有既定轨道的火车，我们应该按自己最想度过的方式，获得自己最想要的游戏体验，玩完这个游戏。而不是唯目的论，所有人定同样的FLAG，终其一生都在求取FLAG的路上。

我们能做什么呢
1）．叩问自己的内心，认清自己究竟想要的是什么，不要被PUA，什么是成功的人生应该是由自己定义。就好像一个抢椅子的游戏，资源有限椅子就那么几把，所有人被PUA只有坐到那些椅子才是成功的，大家终其一生都在拼命的抢那几把椅子，但是椅子数量是有限的，那么一定有很多人一辈子都抢不到，这些人一辈子都在求不得的痛苦中度过，值得吗？你最想坐的椅子可能在其他地方或者其他款式，那才是你应该努力的方向。
2）．金钱和物质不是衡量人生幸福的标准，除了满足基本生存需要外，金钱也好权利也好这些物质都是媒介，我们是通过这些媒介获得精神价值，物质是手段不是目的，就好像我想拥有一栋别墅，本质是别墅能带给我舒适的居住体验或者财富的虚荣，而不是别墅本身。其实不是每个人都要追逐这些物质，你想拥有的未必需要那么多金钱来交换，很可能你可以找到性价比高的方式让自己快乐。

2．物质锁喉，这个话题沉重又现实，简单的说，我想在人生的旷野中旅行，可是我得有盘缠啊。徐霞客一生游山玩水，以自己喜欢的方式度过一生，玩也玩了还名垂青史，可是徐霞客也不是普通人家啊，生存都有问题还想世界这么大我想去看看？这里面有社会财富积累的问题，也有财富分配的问题，33两白银的事情大家可能都听过，这个世界的真相就是一定会出现那么一群人，他们设计规则，控制阶层流动的通道，通过消费洗脑消耗你的劳动剩余，通过规则转移你的财富，教育医疗产业化，住房商品化，很多事情不是你想做，而是没有选择。最近专家们不是又盯上大家的存款了，那些贪婪的人制造了问题，却又进一步把受害的你作为代价去解决问题。这个不准备再深入讲了，而且这个问题作为个人无能为力。为啥大家能接受精神PUA，本质还是喉被锁了，只插一嘴，现在很多乌合之众喷什么可是他获得了自由，其实自由不是想做什么就能做什么，自由是你可以不想做什么就可以说不，可以不被强迫接受自己不想做的事，可以让这只手再也无法锁你的喉，这才是自由真正的价值和意义。
作为个人，我只能讲我想到的我们能做到的
1). 放弃对你不重要的体验或物质需求，资源有限，你的能力也有限，人生没有既要又要，满足核心诉求，学会放下才会拥有自由
2). 小心那些消费主义洗脑和投机主义陷阱，投机并不创造财富，只转移财富，赚自己能力之内的钱(当然如果你善于投机那投机赚的就是你能力之内的钱)，保护住你的财富积累，小心通胀但不要被通胀的焦虑洗脑，上面说过经济是有周期的，现在都要通缩了(不会承认的)，那些天天说要跑赢通胀的其实大多死于跑赢通胀。
3). 如果你是普通人，没有血缘、背景、资金积累，也不会攀附权贵，就尽量去找规则透明、更接近公平公正的环境去施展才能，这点我非常感谢华为公司，老板克制了人性的贪婪，用财散人聚的方式激发了人的主观能动性，提供了一个至少在国内基本公平的环境，释放人性对财富的追逐为自己和公司进行财富积累。

我是个喜欢思考的人，在上学的时候我就基本想清楚了我想要什么，我的优势是什么，我想怎样度过一生，我践行了我所说的这些，总结起来就是四个步骤。
1. 明白自己想要过什么样的人生，优势和短板是什么，最想追求的是什么，可以放弃的是什么
2. 寻找能发挥自己优势的环境，努力积累财富
3. 不被消费主义洗脑，警惕投机陷阱，赚取自己能力之内的钱，放弃对自己不重要的人生选择或支出
4. 达成目标，对那个锁喉的手说句QNM，事了拂衣去，深藏功与名

我的人生已经过半，我追寻如闲云野鹤，心怀明月，背伏清风，隐于市井，醉于山林的人生境界，就像标题里的那首诗，此身天地一虚舟，何处江山不自由，现在我终于可以去按照自己的方式生活，去肆意的享用属于自己的时间了。

最后还是再说一句再见吧，所有的同事、朋友，江湖路远，愿后会有期，祝别来无恙。
